# source: https://github.com/Homebrew/homebrew-bundle

# MARK: Taps

tap "vapor/tap"
tap "homebrew/cask-fonts"

# MARK: Formulas

brew "bat"
brew "bloaty"
brew "cowsay"
brew "direnv"
brew "duf"
brew "dust"
brew "exa"
brew "fd"
brew "fortune"
# NOTE: run `$(brew --prefix)/opt/fzf/install`  in terminal after installation
brew "fzf"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "graphviz"
brew "highlight"
brew "htop"
brew "httpie"
brew "jq"
brew "jrnl"
brew "keith/formulae/zsh-xcode-completions"
brew "llvm"
brew "mas"
brew "neofetch"
brew "node"
brew "ripgrep"
brew "robotsandpencils/made/xcodes"
brew "sourcekitten"
brew "sqlite"
brew "starship"
brew "swiftformat"
brew "swiftlint"
brew "telnet"
brew "terminal-notifier"
brew "tig"
brew "tldr"
brew "tmux"
brew "tokei"
brew "vapor"
brew "vifm"
brew "yamllint"

# MARK: Neovim

brew "neovim", args: ["HEAD"]

brew "cpplint"
brew "shellcheck"
brew "lua-language-server"
brew "tree-sitter"

# MARK: Fonts

cask "font-hack-nerd-font"

# MARK: Applications

cask "alacritty"
cask "alfred"
cask "batteries"
cask "daisydisk"
cask "firefox"
cask "google-drive"
cask "notion"
cask "openemu"
cask "proxyman"
cask "reveal"
cask "sensei"
cask "slack"
cask "via"
cask "1password"
cask "1password/tap/1password-cli"

mas "Bear", id: 1091189122
mas "Kindle", id: 405399194
mas "RocketSim", id: 1504940162
mas "Spark", id: 1176895641
mas "Things", id: 904280696
mas "1Password for Safari", id: 1569813296
mas "Timer RH", id: 929960914
